app/controllers/agencies_controller.rb

  def index
    @agencies = Agency.all
---
SELECT "agencies".* FROM "agencies"