app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "username", "password", "user_data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test User"], ["username", "testing"], ["password", "testing"], ["user_data", "{}"], ["created_at", "2015-09-13 20:55:04.803683"], ["updated_at", "2015-09-13 20:55:04.803683"]]